lvx/base/InformationRegisters/бит_РеестрОбменаСТелеграм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_РеестрОбменаСТелеграм</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыСостоянийТелеграм</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЧатыTelegram</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗапросаТелеграм</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыЗапросовТелеграм</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СообщениеИД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/InformationRegisters/бит_РеестрОбменаСТелеграм/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура удаляет историю записей регистра бит_РеестрОбменаСТелеграм.
// 
// Параметры:
//  РежимСообщений    - Строка.
// 
Процедура УдалитьИсториюЗаписей(РежимСообщений = "Нет") Экспорт
	
	РежимыВывода = бит_ОбщегоНазначения.ОпределитьРежимыВывода(РежимСообщений);		
	
	РезультатЗапроса = УстаревшиеЗаписи();
	
	Если РезультатЗапроса.Пустой() Тогда		
		ТекстСообщения = НСтр("ru='Нет данных для обработки.';en='No data was provided.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Ном = 1;
	КоличествоЗаписей = Выборка.Количество();	
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.бит_РеестрОбменаСТелеграм.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
		Попытка			
			МенеджерЗаписи.Удалить();			
		Исключение			
			Если РежимыВывода.ВыводитьОшибки Тогда
				ТекстСообщения = НСтр("ru = 'Не удалось удалить историю записей регистра %1.';
									  |en = 'Failed to delete the history records for %1.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, Метаданные.РегистрыСведений.бит_РеестрОбменаСТелеграм.Представление());
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения + Символы.ПС + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецЕсли;			
		КонецПопытки; 
		
		Ном = Ном + 1;
	КонецЦикла; 
	
	Если РежимыВывода.ВыводитьИнформацию Тогда		
		ТекстСообщения = НСтр("ru='Удаление истории записей завершено.';
							  |en='Removing history records completed'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);		
	КонецЕсли; 	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция УстаревшиеЗаписи()
	
	АктуальнаяДата = бит_ТелеграмСервер.ГраницаАктуальнойИсторииТелеграм();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеестрОбменаСТелеграм.Чат КАК Чат,
	|	РеестрОбменаСТелеграм.СообщениеИД КАК СообщениеИД,
	|	РеестрОбменаСТелеграм.ВидЗапросаТелеграм КАК ВидЗапросаТелеграм
	|ИЗ
	|	РегистрСведений.бит_РеестрОбменаСТелеграм КАК РеестрОбменаСТелеграм
	|ГДЕ
	|	РеестрОбменаСТелеграм.ДатаОтправки < &ДатаОтправки";
	Запрос.УстановитьПараметр("ДатаОтправки", АктуальнаяДата);
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
